[net]
height=224
width=224
channels=3

[convolutional]
filters=96
size=11
stride=4
pad=0
activation=relu

[maxpool]
stride=2
size=3

[convolutional]
filters=256
size=5
groups=2
stride=1
pad=2
activation=relu

[maxpool]
stride=2
size=3

[convolutional]
filters=384
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=384
size=3
groups=2
stride=1
pad=1
activation=relu

[convolutional]
filters=256
size=3
groups=2
stride=1
pad=1
activation=relu

[maxpool]
stride=2
size=3

[connected]
output=4096
activation=relu

[dropout]
probability=0.500000

[connected]
output=4096
activation=relu

[dropout]
probability=0.500000

[connected]
output=1000

[softmax]
